app/controllers/trips_controller.rb

SELECT  "trips".* FROM "trips" LIMIT 30 OFFSET 0
---
  def index
    @trips = Trip.paginate(page: params[:page], per_page: params[:per_page])

INSERT INTO "trips" ("name", "start_date", "end_date", "update_token") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "trip1"], ["start_date", "2016-04-13 15:00:00.000000"], ["end_date", "2016-04-15 15:00:00.000000"], ["update_token", "59e7dbf5-c80e-47ed-b30b-6b617b0030c4"]]
---
  def create
    if params[:trip]
      @trip = Trip.new(params_trip)
      if @trip.save